using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using Newtonsoft.Json;

namespace DodoxHelper
{
    class Program
    {
        static void Main(string[] args)
        {

            string str = string.Empty;
            int j = 1;
        
            for (int i = 82; i < 96; i++,j++)
            {
                
                str += $"$gameVariables.setValue({i},$gameVariables.value({i}) + 99);";
            }

            string strVariables = "'', '食物', '最大食物', '饮水', '最大饮水', '武艺潜能', '生活经验', '修为', '阅历', '杀人', '善恶', '实战', '任务', '武林排名', '江湖人缘', '当前年龄', '历史年龄', '性别[1男-2女-3中]', '姓名[玩家]', '随机消耗饮食度', '随机消耗饮水度', '增加经验', '增加潜能', '增加金钱', '[NPC]ID', '[NPC]姓名', '[NPC]武艺', '[NPC]内功', '[NPC]称号', '[NPC]描述', '[NPC]银两', '内功属性[1阳-2毒-3阴-4普通-5混元]', '游戏难度[3-6-10]', '获取当前生命', '获取最大生命', '获取当前内力', '获取最大内力', '获取臂力', '获取根骨', '获取敏捷', '获取悟性', '基本拳脚·等级', '基本拳脚·熟练度', '基本拳脚·升级条件', '基本兵器·等级', '基本兵器·熟练度', '基本兵器·升级条件', '基本轻功·等级', '基本轻功·熟练度', '基本轻功·升级条件', '基本外功·等级', '基本外功·熟练度', '基本外功·升级条件', '基本内功·等级', '基本内功·熟练度', '基本内功·升级条件', '----------------------', '[门派]ID', '历史版本号', '当前版本号', '最新版本号', 'ID[学习武功]', 'ID[角色]', '已练功次数', '欲练功次数', '练功消耗潜能', '特色[门派技艺]', '教学能力', '获取身上银两', '练功消耗银两', '打坐[外功回血]', '打坐[内功回内]', '走火入魔几率', '获取攻击力', '获取防御力', '药物中毒[概率]', '----------------------', '告示[联网内容]', '编号A', '编号B', '编号C', '技艺成功率', '音律', '书法', '医术', '棋术', '绘画', '毒术', '伐木', '赌运', '钓鱼', '打猎', '采矿', '锻造', '饮酒', '厨艺', '读书', '----------------------', '密码', '输入的数字', '排名调整', '仇恨度', '吃美味的次数', '喝美酒的次数', '追杀值', '完成寻物的次数', '----------------------', '对话[陌生人交谈]', '对话[普通随机交谈]', '----------------------', '标题[联网]', '内容[联网]', '日期[联网]', '[通知]本地序号', '[通知]千里传音内容', '[通知]更新时间', '上吊次数', '当前现实时间', '储存历史时间', '时间差', '江湖宝典页码', '拳脚一阶·等级', '拳脚一阶·熟练度', '拳脚一阶·升级条件', '拳脚二阶·等级', '拳脚二阶·熟练度', '拳脚二阶·升级条件', '兵器一阶·等级', '兵器一阶·熟练度', '兵器一阶·升级条件', '兵器二阶·等级', '兵器二阶·熟练度', '兵器二阶·升级条件', '门派轻功·等级', '门派轻功·熟练度', '门派轻功·升级条件', '内功一阶·等级', '内功一阶·熟练度', '内功一阶·升级条件', '上吊次数', '锻造结果', '内功二阶·等级', '内功二阶·熟练度', '内功二阶·升级条件', '门派外功·等级', '门派外功·熟练度', '门派外功·升级条件', '门派绝学一·等级', '门派绝学一·熟练度', '门派绝学一·升级条件', '门派绝学二·等级', '门派绝学二·熟练度', '门派绝学二·升级条件', '----------------------', '侠客的级别', '反贼的级别', '调戏女孩次数', '追杀反贼次数', '善恶任务次数', '连续寻物次数', '', '切磋[ID]', '屠杀[ID]', '签到时间', '连续签到', '卖花时间', '奖励金钱', '赌场买大小', '六面骰子', '骰子大小', '赌场连胜次数', '赢钱次数', '输钱次数', '检测游戏的时间', '', '卖酒时间', '----------------------', '[技艺]ID', '历史版本号', '当前版本号', '计数器', '村长-友善度', '王婆婆-友善度', '张猎户-友善度', '岳不群-友善度', '林平之-友善度', '玄慈-友善度', '扫地僧-友善度', '张三丰-友善度', '张翠山-友善度', '灭绝师太-友善度', '周芷若-友善度', '血刀老祖-友善度', '狄云-友善度', '王重阳-友善度', '尹志平-友善度', '小龙女-友善度', '杨过-友善度', '萧峰-友善度', '洪七公-友善度', '天山童姥-友善度', '虚竹-友善度', '段誉-友善度', '白自在-友善度', '白万剑-友善度', '阿秀-友善度', '丁春秋-友善度', '阿紫-友善度', '任我行-友善度', '东方不败-友善度', '任盈盈-友善度', '丁鹏-友善度', '玄痛-友善度', '', '', '', '', '', '', '', '', '新手引导任务', '张猎户的需求', '冯村长的日常', '拜见者的名字', '田伯光的日常', '调戏者的名字', '寻捕的日常', '反贼的名字', '反贼的地点', '中年妇女的日常', '寻物的名字', '寻物的地点', '[生长时间]铜矿', '[生长时间]铁矿', '[生长时间]银矿', '[生长时间]金矿', '[生长时间]枯树', '[生长时间]黄树', '[生长时间]绿树', '[生长时间]红树', '[随机敌人]ID', '[DI:1]随机善人', '[DI:2]随机善人', '[DI:3]随机善人', '[DI:4]随机善人', '[DI:5]随机善人', '[DI:1]随机恶人', '[DI:2]随机恶人', '[DI:3]随机恶人', '[DI:4]随机恶人', '[DI:5]随机恶人', '杀死善人总数', '杀死恶人总数', '', '', '', '', '', '', '[木人]ID', '[节日]输入错误次数', '[节日]本地序号', '[节日]内容', '[福利]输入错误次数', '[福利]本地序号', '[福利]内容', '----------------------', '善恶洞层数', '记录现实日', '记录现实时', '记录现实分', '当前现实日', '当前现实时', '当前现实分', '经过现实日', '经过现实时', '经过现实分', '[记录]离线挂机时间', '当前年月日', '[少林寺]武功倍率', '当前游戏时间', '经过现实时间', '还需现实时间', '挂机获得潜能', '挂机打坐次数', '总挂机次数', '离线分钟消耗', '掉落物品[1]', '掉落物品[2]', '掉落物品[3]', '增加饮水', '增加饮食', '游戏初始版本', '平一指的时间', '已经掌握的少林秘籍', '[更新]内容提示', '[赌运]提高成功率', '住宿花费银两', '[生长时间]草药', '[店铺]开业时间', '芦溪_铜矿_1', '芦溪_黄树_1', '芦溪_枯树_2', '芦溪_铁矿_1', '芦溪_草药_1', '宁静_黄树_1', '宁静_枯树_2', '宁静_铜矿_1', '镇东_黄树_1', '镇东_枯树_2', '芦溪_铜矿_2', '镇北_枯树_1', '华山_黄树_1', '华山_枯树_2', '华山_枯树_3', '华山_黄树_4', '华山_红树_5', '华山_铁矿_1', '华山_银矿_2', '华山_草药_1', '武当_黄树_1', '武当_枯树_2', '武当_草药_1', '峨眉_黄树_1', '峨眉_铁矿_1', '峨眉_铜矿_2', '峨眉_草药_1', '摩天_红树_1', '金蛇_金矿_1', '衡山_银矿_1', '少林_银矿_1', '名剑_铜矿_1', '名剑_金矿_2', '芦溪_鱼塘_1', '少林_黄树_1', '少林_黄树_2', '少林_金矿_1', '峨眉_绿树_1', '全真_绿树_1', '全真_绿树_2', '[套装]·独行', '[鱼塘]恢复时间', '[鱼塘]钓鱼次数_芦溪', '[耐久度]鱼竿', '[耐久度]斧头', '[耐久度]铁镐', '开箱子的次数', '[经脉]元气值', '[经脉]成功率', '[经脉]成功率提升', '[筋脉]毒内功伤害', '[筋脉]阳内功伤害', '[筋脉]阴内功伤害', '[鱼塘]钓鱼次数_武当', '[鱼塘]钓鱼次数_少林', '[鱼塘]钓鱼次数_华山', '买药时间', '任我行切磋时间', '[轻功]当前轻功值', '[轻功]最大轻功值', '全真_红树_1', '全真_铁矿_1', '全真_铜矿_2', '古墓_草药_1', '血刀_绿树_1', '丐帮_绿树_1', '丐帮_绿树_2', '丐帮_黄树_1', '丐帮_草药_1', '衡山_枯树_1', '古墓_玉峰_1', '武当_鱼塘_1', '少林_鱼塘_1', '华山_鱼塘_1', '雪山_雪莲_all', '江南_矿洞_all', '百花_草药_1', '百花_草药_2', '百花_草药_3', '绝情_草药_1', '坐牢时间', '[建设度]·平安镇', '[建设度]·扬州', '[建设度]·京城', '[建设度]·大理', '[建设度]·朱仙镇', '[建设度]·平安任务序号', '[百姓数量]·平安镇', '[百姓数量]·扬州', '[百姓数量]·京城', '[百姓数量]·大理', '[百姓数量]·朱仙镇', '[建设度]·扬州任务序号', '[建设度]·大理任务序号', '[建设度]·京城任务序号', '[建设度]·朱仙任务序号', '居民[序号]', '居民任务[序号]', '可掌握的少林秘籍', '[赌运]提高成功率', '[百姓时间]·平安镇', '[百姓时间]·扬州', '[百姓时间]·京城', '[百姓时间]·大理', '[百姓时间]·朱仙镇', '[搬迁时间]·平安镇', '[搬迁时间]·扬州', '[搬迁时间]·京城', '[搬迁时间]·大理', '[搬迁时间]·朱仙镇', '经书的名字', '经书的地点', '找经书的任务', '连续找经书次数', '胡青牛的时间', '[金蛇剑]威力系数', '[赤练神掌]威力爆发', '[金蛇剑]威力爆发', '[系列任务]胡斐', '[胡家刀法]威力爆发', '[全真教]武功倍率', '门派交易时间', '[丐帮]武功倍率', '[队伍]人员数量', '[系列任务]封不平', '[狂风快剑]威力爆发', '[系列任务]成昆', '[七伤拳]威力爆发', '[系列任务]一灯大师', '[太玄神掌]威力爆发', '[系列任务]岳飞', '[系列任务]杨不悔', '[系列任务]南贤', '[系列任务]韦小宝', '', '', '', '', '', '', '[冷却时间]切磋', '连续战斗', '五毒_蜘蛛_1', '五毒_青蛇_1', '五毒_蟾蜍_1', '五毒_蜈蚣_1', '五毒_蜘蛛_2', '五毒_蜘蛛_3', '五毒_蜘蛛_4', '五毒_蜘蛛_5', '五毒_青蛇_2', '五毒_蟾蜍_2', '五毒_蜘蛛_6', '五毒_蟾蜍_3', '五毒_蜘蛛_7', '五毒_青蛇_3', '五毒_蟾蜍_4', '五毒_青蛇_4', '五毒_蜈蚣_2', '少林_草药_1', '灵鹫_草药_1', '华山_草药_2', '灵鹫_红树_2', '[鱼塘]钓鱼次数_无量', '无量_鱼塘_1', '[鱼塘]钓鱼次数_灵鹫', '灵鹫_鱼塘_1', '无量_蟾蜍_1', '无量_草药_1', '无量_黄树_1', '绝情_绿树_1', '绝情_红树_1', '星宿_黄树_1', '星宿_绿树_1', '星宿_青蛇_1', '星宿_蜈蚣_1', '星宿_蟾蜍_1', '', '', '', '武当悟道时间', '抓奸细的任务', '抓奸细的日常', '被盗走的物品', '连续抓奸细的次数', '[官职]武官级别', '职位经验', '领取俸禄时间', '血刀练功时间', '指南针绑定点', '[五子棋]胜利', '连续偷物资的次数', '偷物资的日常', '偷物资的任务', '需要偷的物品', '[耐久度]连弩', '钱庄兑换汇率', '[唐诗剑法]威力系数', '[对话]显示', '[友善度]显示', '大理_黄树_1', '大理_绿树_1', '大理_黄树_2', '大理_绿树_2', '大理_银矿_1', '嵩山_金矿_1', '燕子_红树_1', '燕子_银矿_1', '燕子_草药_1', '聋哑_金矿_1', '聋哑_黄树_1', '野猪_大象_1', '野猪_野狼_1', '野猪_山羊_1', '野猪_水牛_1', '野猪_麋鹿_1', '野猪_白猿_1', '野猪_老虎_1', '野猪_白熊_1', '野猪_野狼_2', '野猪_野狼_3', '野猪_麋鹿_2', '野猪_山羊_2', '野猪_麋鹿_3', '野猪_野狼_4', '野猪_山羊_3', '野猪_野狼_5', '野猪_麋鹿_4', '野猪_黑熊_1', '野猪_野狼_6', '野猪_麋鹿_5', '野猪_白虎_1', '绝情_鳄鱼_1', '无量_鳄鱼_2', '柳溪_水牛_1', '芦溪_水牛_2', '', '', '', '', '[保存]臂力', '[保存]根骨', '[保存]敏捷', '[保存]悟性', '[保存]生命', '[保存]内力', '[保存]金钱', '[保存]武艺潜能', '----------------------', '[异常记录]可能性', '[异常]属性', '[异常]数值', '[异常]银两', '[异常]武艺潜能', '增加的仇恨度', '佛门弟子', '', '', '', ''";
            string[] variablesArray = strVariables.Split(',');
            File.Create("variables.txt");
            List<ItemVariable> itemVariables = new List<ItemVariable>();
            for (int i = 0; i < variablesArray.Count(); i++)
            {
                itemVariables.Add(new ItemVariable() {Id=i,Value= variablesArray[i] });
            }
            string strItemVariables = JsonConvert.SerializeObject(itemVariables);
            File.WriteAllText("variables.json", strItemVariables);

            #region MyRegion
            //while (true)
            //{
            //    Console.WriteLine("请输入Variables序列：");
            //    string strInput = Console.ReadLine();
            //    int number = 0;
            //    string result = string.Empty;
            //    string[] inputs = strInput.Split(new char[] { ',', '，' });
            //    for (int j = 0; j < inputs.Count(); j++)
            //    {
            //        for (int i = 0; i < variablesArray.Count(); i++)
            //        {
            //            if (int.TryParse(inputs[j], out number))
            //            {
            //                if (j == i)
            //                {
            //                    result = variablesArray[number];
            //                    Console.Write(result + ",");
            //                }
            //            }
            //            else
            //            {
            //                if (variablesArray[i].Contains(inputs[j]))
            //                {
            //                    Console.Write($"{i}=={variablesArray[i]}, ");
            //                }
            //            }
            //        }
            //    }
            //    Console.WriteLine();
            //} 
            #endregion
        }
    }

    public class ItemVariable
    {
        public int Id { get; set; }
        public string Value { get; set; }
    }
}
